In [2]:
import pandas as pd

In [4]:
data = {'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May'],'Product_A': [150, 200, 250, 300, 350],'Product_B': [300, 250, 200, 150, 100]}

In [8]:
sales_data = pd.DataFrame(data)

In [10]:
sales_data

  Month  Product_A  Product_B
0   Jan        150        300
1   Feb        200        250
2   Mar        250        200
3   Apr        300        150
4   May        350        100

In [12]:
total_sales = sales_data[['Product_A', 'Product_B']].sum()

In [14]:
total_sales

Product_A    1250
Product_B    1000
dtype: int64

In [16]:
month_highest_sales_A = sales_data['Month'][sales_data['Product_A'].idxmax()]

In [20]:
month_highest_sales_A

'May'

In [22]:
sales_data['Total_Sales'] = sales_data['Product_A'] + sales_data['Product_B']

In [24]:
sales_data

  Month  Product_A  Product_B  Total_Sales
0   Jan        150        300          450
1   Feb        200        250          450
2   Mar        250        200          450
3   Apr        300        150          450
4   May        350        100          450

In [26]:
sales_data['Product_A_Normalized'] = sales_data['Product_A'] / sales_data['Product_A'].max()

In [28]:
sales_data

  Month  Product_A  Product_B  Total_Sales  Product_A_Normalized
0   Jan        150        300          450              0.428571
1   Feb        200        250          450              0.571429
2   Mar        250        200          450              0.714286
3   Apr        300        150          450              0.857143
4   May        350        100          450              1.000000

In [30]:
filtered_sales_data = sales_data[sales_data['Total_Sales'] > 400]

In [32]:
filtered_sales_data

  Month  Product_A  Product_B  Total_Sales  Product_A_Normalized
0   Jan        150        300          450              0.428571
1   Feb        200        250          450              0.571429
2   Mar        250        200          450              0.714286
3   Apr        300        150          450              0.857143
4   May        350        100          450              1.000000